x1 = int(input('Введите координаты х1:'))
y1 = int(input('Введите координаты y1:'))
x2 = int(input('Введите координаты х2:'))
y2 = int(input('Введите координаты y2:'))

if x1 == 0 or y1 == 0 or x2 == 0 or y2 == 0:
    print('Несоответсвует условию')
    exit()

elif (x1 >= 1 and y1 >= 1) and (x2 >= 1 and y2 >= 1):
    print('точки лежат в первой четверти')

elif (x1 <= -1 and y1 >= 1) and (x2 <= -1 and y2 >= 1):
    print('точки лежат во второй четверти')

elif (x1 <= -1 and y1 <= -1) and (x2 <= -1 and y2 <= -1):
    print('точки лежат в третьей четверти')

elif (x1 >= 1 and y1 <= -1) and (x2 >= 1 and y2 <= -1):
    print('точки лежат в четвертой четверти')
else:
    print('Точки в разных четвертях')